import math

#X1-перша торгова точка
#X2-друга торгова точка
#g -сприятливі обставини
#b -несприятливі обставини
#p -ймовірність
#m -прибуток

X1gp = float(0.4)
X1gm = int(40)
X1bp = float(0.6)
X1bm = int(30)

X2gp = float(0.8)
X2gm = int(35)
X2bp = float(0.2)
X2bm = int(25)

M_X1 = X1gp * X1gm + X1bp + X1bm
M_X2 = X2gp * X2gm + X2bp + X2bm

print("Сподівані значення теперішньої вартості(NPV) першої торгової точки:", M_X1)
print("Сподівані значення теперішньої вартості(NPV) другої торгової точки:", M_X2)

V_X1 = pow((X1gm - M_X1), 2) * X1gp + pow((X1bm - M_X1), 2) * X1bp
V_X2 = pow((X2gm - M_X2), 2) * X2gp + pow((X2bm - M_X2), 2) * X2bp

o_X1 = math.sqrt(V_X1)
o_X2 = math.sqrt(V_X2)

print("\nОцінка ризиків першої торгової точки")
print("Дисперсія:", V_X1)
print("Середньоквадратичне відхилення:", o_X1)

print("\nОцінка ризиків другої торгової точки")
print("Дисперсія:", V_X2)
print("Середньоквадратичне відхилення:", o_X2)

CV_X1 = o_X1 / M_X1
CV_X2 = o_X2 / M_X2

print("\nПоказник кількісної оцінки ризику коефіцієнт варіації першої торгової точки:", CV_X1)
print("Показник кількісної оцінки ризику коефіцієнт варіації другої торгової точки:", CV_X2)

SSV_X1 = math.sqrt(pow((X1bm - M_X1), 2) * X1bp)
SSV_X2 = math.sqrt(pow((X2bm - M_X2), 2) * X2bp)

CSV_X1 = SSV_X1 / M_X1
CSV_X2 = SSV_X2 / M_X2

print("\nСеміквадратичне відхилення першої торгової точки:", SSV_X1)
print("Коефіцієнт семіваріації:", CSV_X1)

print("\nСеміквадратичне відхилення другої торгової точки:", SSV_X2)
print("Коефіцієнт семіваріації:", CSV_X2)

if o_X1 < o_X2:
    print("\nВиходячи з позиції мінімального ризику треба ліквідувати 2 торгівельну точку.")
else:
    print("\nВиходячи з позиції мінімального ризику треба ліквідувати 1 торгівельну точку.")
